<template>
	
	<div style="margin-top: 30px" class="">
		<h1>{{ title }}</h1>
		<dl class="dl-horizontal row">
			<template v-for="item in descriptions" track-by="$index">
			  <dt class="col-sm-3">{{ item.name }}</dt>
			  <dd class="col-sm-9">
			  	{{ item.context }}
			  </dd>
			</template>
		</dl>
	</div>
	<img src="http://7xrn7f.com1.z0.glb.clouddn.com/16-6-10/15794172.jpg"
		style="width:100%">
</template>

<script>
	export default {
		data() {
			return {
				title: 'Skills',
				descriptions: [
					{ name: '梯云纵', context:'武当派的轻功绝技，堪称轻功中的轻功，其注重身法的轻灵，不以步法多变来迷惑对手，要旨是身形轻巧，高低进退自如。' },
					{ name: '九阳神功', context:'乃根据《九阳真经》里面的口诀修炼出来的一门至高无上的内功心法。练成九阳神功者,内力可自生于体源源不绝，百毒不侵，更深具医疗之能，当对手攻击自身时身体自生护体反震之力，任何一掌一式由九阳神功使出来都威力其大，学成阳神功者任何武学一学即通，小说中张无忌就曾用此神功使出七伤拳，一拳即震断大树威力巨大更胜原本的七伤拳法。' },
					{ name: '武当长拳', context:'武当派三十二势入门功夫，拦截架格，腾挪闪让均要求出手有力，发脚迅速，手足齐到，动作分明。' },
					{ name: '七伤拳', context:'崆峒派镇山绝技，可以同时发出或刚猛或阴柔的不同劲力，摧伤敌人脏腑，拳力复杂，吞吐闪烁，变幻万端。但使用时会令自身脏腑也受到伤害。由于张无忌的“九阳神功”极为浑厚，因此他使用七伤拳时完全没受半点反扑伤害，威力亦更胜“崆峒五老”谢逊。龙爪手' },
					{ name: '龙爪手', context:'少林七十二绝技之一，共分三十六式，手指坚硬愈钢，铁指开砖如泥，手如钢爪般抓树撕皮，搓石成粉，剑指开顽石等铁指神功，瞬间致敌于伤残。在和空性神憎战斗时利用战斗时间和天生的悟性学会。' },
					{ name: '乾坤大挪移', context:'波斯明教总教的镇教之宝，此心法共分七层境界，是运劲用力的一项极巧妙法门，可以激发常人体内潜藏的力量；要旨是武学中的“借力打力”、“四两拨千斤”，但其中变化神奇，却是匪夷所思；能制造对手破绽，寻瑕抵隙，对方百计防护，尚且不稳；能积蓄劲力，将对手的力量渐渐积蓄，突然间反震出去，便如一座大湖在山洪爆发时储满了洪水，猛地里湖堤崩决，洪水急冲而出，将对手送来的力量尽数倒回；掌力游走不定，虚虚实实，能将对手的力量同时粘住了；能牵引挪移敌劲；颠倒一刚一柔、一阴一阳的乾坤二气，能转换于不知不觉之间，外形上便半点也看不出来了等。' },
					{ name: '圣火令武功', context:'“山中老人”霍山所创的诡异武功，路数指东打西，令人防不胜防，身法怪异达极点，是旁门左道武学的巅峰，算是一门邪道武学。' },
				]
			}
		}
	}
</script>

<style type="text/css">
.background-kongfu {
	background-image: url(http://7xrn7f.com1.z0.glb.clouddn.com/16-6-10/34652102.jpg);
	background-size: 150%;
	color: red;
}
</style>